tap "azure/functions"
tap "homebrew/bundle"
brew "gcc@11"
brew "nvm"
brew "pyenv"
brew "python@3.11"
brew "zlib"
brew "azure/functions/azure-functions-core-tools@4"
vscode "aaron-bond.better-comments"
vscode "Azurite.azurite"
vscode "DanielSanMedium.dscodegpt"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "Gimly81.matlab"
vscode "GitHub.copilot-nightly"
vscode "GrapeCity.gc-excelviewer"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "KevinRose.vsc-python-indent"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-dotnettools.csharp"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "njpwerner.autodocstring"
vscode "PKief.markdown-checkbox"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "TaiyoFujii.novel-writer"
vscode "the-compiler.python-tox"
